nozzlesimulations/r1_re5.63m_pr1.84/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
	inlet
	{
		type	fixedValue;	
		value	uniform 293.15;
	}

	outlet
	{
		type	zeroGradient;
	}

	wall
	{
		type	zeroGradient; 
	}

	heatedWall
	{
		type	fixedGradient; 
		gradient uniform 407106.5; 
	}

	frontAndBack
	{
		type	empty;	
	}
}

// ************************************************************************* //
