nozzlesimulations/r1_re5.63m_pr1.84/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{   
	inlet
	{
		type	fixedValue;	
		value	uniform (1 0 0);
	}

	outlet
	{
		type	zeroGradient;
	}

	wall
	{
		type	fixedValue; 
		value	uniform (0 0 0); 
	}

	heatedWall
	{
		type	fixedValue; 
		value	uniform (0 0 0); 
	}

	frontAndBack
	{
		type	empty;	
	}
}

// ************************************************************************* //
