nozzlesimulations/r1_re5.63m_pr1.84/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0225;

boundaryField
{
	inlet
	{
		type	fixedValue;	
		value	uniform 0.0225;
	}

	outlet
	{
		type	zeroGradient;
	}

	wall
	{
        type            kqRWallFunction;
        value           uniform 0.0225; 
	}

	heatedWall
	{
        type            kqRWallFunction;
	value		uniform 0.0225; 
	}

	frontAndBack
	{
		type	empty;	
	}
}


// ************************************************************************* //
