nozzlesimulations/r1_re5.63m_pr1.84/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 8;

vertices
(
	(-1.725 0 0) 			//0
	(-1.723867382 0.0625 0)		//1
	(-1.786407008 0.0625 0)	//2
	(-1.7875 0 0)			//3
	(-1.725 0 1)			//4
	(-1.7875 0 1)			//5
	(-1.786407008 0.0625 1)	//6
	(-1.85 0 0)			//7	
	(-1.848943955 0.0625 0)	//8
	(-1.848943955 0.0625 1)	//9
	(-1.85 0 1)			//10
	(-5 0 0)			//11
	(-5 0.0625 0)			//12
	(-5 0.0625 1)			//13
	(-5 0 1)			//14
	
	(0 1.725 1)			//15
	(0 1.725 0)			//16
	(0 1.7875 1)			//17
	(0 1.7875 0)			//18
	(0 1.85 1)			//19
	(0 1.85 0)			//20

	(1.725 0 1)			//21
	(1.725 0 0)			//22
	(1.723867382 0.0625 0)		//23
	(1.723867382 0.0625 1)		//24
	(1.7875 0 1)			//25
	(1.7875 0 0)			//26
	(1.786407008 0.0625 0)		//27
	(1.786407008 0.0625 1)		//28
	(1.85 0 1)			//29
	(1.85 0 0)			//30
	(1.848943955 0.0625 0)		//31
	(1.848943955 0.0625 1)		//32
	(5 0 1)				//33
	(5 0 0)				//34
	(5 0.0625 0)			//35
	(5 0.0625 1)			//36

	(-1.723867382 0.0625 1)		//37

	(-1.723867382 -0.0625 0)	//38
	(-1.723867382 -0.0625 1)	//39
	(-1.786407008 -0.0625 1)	//40
	(-1.786407008 -0.0625 0)	//41
	(-1.848943955 -0.0625 1)	//42
	(-1.848943955 -0.0625 0)	//43
	(-5 -0.0625 1)			//44
	(-5 -0.0625 0)			//45
	
	(0 -1.725 0)			//46
	(0 -1.725 1)			//47
	(0 -1.7875 0)			//48
	(0 -1.7875 1)			//49
	(0 -1.85 0)			//50
	(0 -1.85 1)			//51

	(1.723867382 -0.0625 1)		//52
	(1.723867382 -0.0625 0)		//53
	(1.786407008 -0.0625 1)		//54
	(1.786407008 -0.0625 0)		//55
	(1.848943955 -0.0625 1)		//56
	(1.848943955 -0.0625 0)		//57
	(5 -0.0625 1)			//58
	(5 -0.0625 0)			//59
);

blocks
(
	hex (11 7 8 12 14 10 9 13) (100 20 1) simpleGrading (0.00025 0.005 1)		//0
	hex (7 3 2 8 10 5 6 9) (20 20 1) simpleGrading (400 0.005 1)			//1
	hex (3 0 1 2 5 4 37 6) (20 20 1) simpleGrading (0.0025 0.005 1)			//2
	hex (2 1 16 18 6 37 15 17) (20 100 1) simpleGrading (0.0025 2000 1)		//3
	hex (8 2 18 20 9 6 17 19) (20 100 1) simpleGrading (400 2000 1)			//4
	
	hex (16 23 27 18 15 24 28 17) (100 20 1) simpleGrading (0.0005 400 1)		//5
	hex (18 27 31 20 17 28 32 19) (100 20 1) simpleGrading (0.0005 0.0025 1)	//6
	hex (22 26 27 23 21 25 28 24) (20 20 1) simpleGrading (400 0.005 1)		//7
	hex (26 30 31 27 25 29 32 28) (20 20 1) simpleGrading (0.0025 0.005 1)		//8
	hex (30 34 35 31 29 33 36 32) (100 20 1) simpleGrading (4000 0.005 1) 		//9

	hex (45 43 7 11 44 42 10 14) (100 20 1) simpleGrading (0.00025 200 1)		//10
	hex (43 41 3 7 42 40 5 10) (20 20 1) simpleGrading (400 200 1)			//11
	hex (41 38 0 3 40 39 4 5) (20 20 1) simpleGrading (0.0025 200 1)		//12
	hex (43 50 48 41 42 51 49 40) (100 20 1) simpleGrading (2000 400 1)		//13
	hex (41 48 46 38 40 49 47 39) (100 20 1) simpleGrading (2000 0.0025 1)	//14
	
	hex (48 55 53 46 49 54 52 47) (100 20 1) simpleGrading (0.0005 0.0025 1)	//15
	hex (50 57 55 48 51 56 54 49) (100 20 1) simpleGrading (0.0005 400 1)		//16
	hex (53 55 26 22 52 54 25 21) (20 20 1) simpleGrading (400 200 1)		//17
	hex (55 57 30 26 54 56 29 25) (20 20 1) simpleGrading (0.0025 200 1)		//18
	hex (57 59 34 30 56 58 33 29) (100 20 1) simpleGrading (4000 200 1)		//19

);

edges
(
	arc 0 1 (-1.724716915 0.03125 0)
	arc 4 37 (-1.724716915 0.03125 1)

	arc 3 2 (-1.787226815 0.03125 0)
	arc 5 6 (-1.787226815 0.03125 1)
	
	arc 7 8 (-1.849736045 0.03125 0)
	arc 10 9 (-1.849736045 0.03125 1)

	arc 1 16 (-1.219759198 1.219759198 0)
	arc 37 15 (-1.219759198 1.219759198 1)

	arc 2 18 (-1.263953371 1.263953371 0)
	arc 6 17 (-1.263953371 1.263953371 1)
	 
	arc 8 20 (-1.308147545 1.308147545 0)
	arc 9 19 (-1.308147545 1.308147545 1)
	
	///

	arc 22 23 (1.724716915 0.03125 0)
	arc 21 24 (1.724716915 0.03125 1)

	arc 26 27 (1.787226815 0.03125 0)
	arc 25 28 (1.787226815 0.03125 1)

	arc 30 31 (1.849736045 0.03125 0)
	arc 29 32 (1.849736045 0.03125 1)

	arc 23 16 (1.219759198 1.219759198 0)
	arc 24 15 (1.219759198 1.219759198 1)

	arc 27 18 (1.263953371 1.263953371 0)
	arc 28 17 (1.263953371 1.263953371 1)

	arc 31 20 (1.308147545 1.308147545 0)
	arc 32 19 (1.308147545 1.308147545 1)

	///

	arc 0 38 (-1.724716915 -0.03125 0)
	arc 4 39 (-1.724716915 -0.03125 1)

	arc 3 41 (-1.787226815 -0.03125 0)
	arc 5 40 (-1.787226815 -0.03125 1)

	arc 7 43 (-1.849736045 -0.03125 0)
	arc 10 42 (-1.849736045 -0.03125 1)

	arc 38 46 (-1.219759198 -1.219759198 0)
	arc 39 47 (-1.219759198 -1.219759198 1)	

	arc 41 48 (-1.263953371 -1.263953371 0)
	arc 40 49 (-1.263953371 -1.263953371 1)

	arc 43 50 (-1.308147545 -1.308147545 0)
	arc 42 51 (-1.308147545 -1.308147545 1)

	///

	arc 22 53 (1.724716915 -0.03125 0)
	arc 21 52 (1.724716915 -0.03125 1)

	arc 26 55 (1.787226815 -0.03125 0)
	arc 25 54 (1.787226815 -0.03125 1)

	arc 30 57 (1.849736045 -0.03125 0)
	arc 29 56 (1.849736045 -0.03125 1)

	arc 55 48 (1.263953371 -1.263953371 0)
	arc 54 49 (1.263953371 -1.263953371 1)

	arc 57 50 (1.308147545 -1.308147545 0)
	arc 56 51 (1.308147545 -1.308147545 1)

	arc 46 53 (1.219759198 -1.219759198 0)
	arc 47 52 (1.219759198 -1.219759198 1)

);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(13 12 11 14)
			(14 11 45 44)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(35 36 33 34)
			(34 33 58 59)
		);
	}

	wall
	{
		type wall;
		faces
		(
			(8 12 13 9)
			(20 8 9 19)
			(20 19 32 31)
			(31 32 36 35)

			(44 45 43 42)
			(42 43 50 51)
			(50 57 56 51)
			(56 57 59 58)
		);
	}
	
	heatedWall
	{
		type wall;
		faces
		(
			(1 37 4 0)
			(1 16 15 37)
			(16 23 24 15)
			(24 23 22 21)
			
			(0 4 39 38)
			(38 39 47 46)
			(52 53 46 47)
			(21 22 53 52)

		);
	}

	frontAndBack
	{
		type empty;
		faces
		(
			(12 8 7 11)
			(8 2 3 7)
			(2 1 0 3)
			(8 20 18 2)
			(2 18 16 1)
			(20 31 27 18)
			(18 27 23 16)
			(23 27 26 22)
			(27 31 30 26)
			(31 35 34 30)

			(13 14 10 9)
			(6 9 10 5)
			(37 6 5 4)
			(17 6 37 15)
			(19 9 6 17)
			(19 17 28 32)
			(17 15 24 28)
			(24 21 25 28)
			(28 25 29 32)
			(32 29 33 36)

			(11 7 43 45)
			(7 3 41 43)
			(3 0 38 41)
			(43 41 48 50)
			(41 38 46 48)
			(46 53 55 48)
			(48 55 57 50)
			(22 26 55 53)
			(26 30 57 55)
			(30 34 59 57)

			(14 44 42 10)
			(10 42 40 5)
			(5 40 39 4)
			(40 42 51 49)
			(39 40 49 47)
			(52 47 49 54)
			(54 49 51 56)
			(21 52 54 25)
			(29 25 54 56)
			(33 29 56 58)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
