nozzlesimulations/r1_re5.63m_pr1.84/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       53720;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       53760;
    }
    wall
    {
        type            wall;
        nFaces          800;
        startFace       53800;
    }
    heatedWall
    {
        type            wall;
        nFaces          480;
        startFace       54600;
    }
    frontAndBack
    {
        type            empty;
        nFaces          54400;
        startFace       55080;
    }
)

// ************************************************************************* //
